## Terraform Plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.testvm1.proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "104"
        name                    = "testvm1"
      ~ protection              = false -> true
      ~ stop_on_destroy         = false -> true
      ~ timeout_clone           = 1800 -> 7200
      ~ timeout_create          = 1800 -> 7200
      ~ timeout_migrate         = 1800 -> 3600
      ~ timeout_reboot          = 1800 -> 3600
      ~ timeout_shutdown_vm     = 1800 -> 3600
      ~ timeout_start_vm        = 1800 -> 3600
      ~ timeout_stop_vm         = 300 -> 600
        # (18 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.testvm2.proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "106"
        name                    = "testvm2"
      ~ protection              = false -> true
      ~ stop_on_destroy         = false -> true
      ~ timeout_clone           = 1800 -> 7200
      ~ timeout_create          = 1800 -> 7200
      ~ timeout_migrate         = 1800 -> 3600
      ~ timeout_reboot          = 1800 -> 3600
      ~ timeout_shutdown_vm     = 1800 -> 3600
      ~ timeout_start_vm        = 1800 -> 3600
      ~ timeout_stop_vm         = 300 -> 600
        # (18 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.testvm3.proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "testvm3"
      + network_interface_names = (known after apply)
      + node_name               = "proxmox"
      + on_boot                 = true
      + protection              = true
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = true
      + tablet_device           = true
      + template                = false
      + timeout_clone           = 7200
      + timeout_create          = 7200
      + timeout_migrate         = 3600
      + timeout_move_disk       = 1800
      + timeout_reboot          = 3600
      + timeout_shutdown_vm     = 3600
      + timeout_start_vm        = 3600
      + timeout_stop_vm         = 600
      + vm_id                   = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full    = true
          + retries = 1
          + vm_id   = 105
        }

      + cpu {
          + cores      = 2
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "qemu64"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = (known after apply)
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 150
          + ssd               = false
        }

      + memory {
          + dedicated      = 4096
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + vga (known after apply)
    }

  # module.testvm4.proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "testvm4"
      + network_interface_names = (known after apply)
      + node_name               = "proxmox"
      + on_boot                 = true
      + protection              = true
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = true
      + tablet_device           = true
      + template                = false
      + timeout_clone           = 7200
      + timeout_create          = 7200
      + timeout_migrate         = 3600
      + timeout_move_disk       = 1800
      + timeout_reboot          = 3600
      + timeout_shutdown_vm     = 3600
      + timeout_start_vm        = 3600
      + timeout_stop_vm         = 600
      + vm_id                   = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full    = true
          + retries = 1
          + vm_id   = 105
        }

      + cpu {
          + cores      = 2
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "qemu64"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = (known after apply)
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 150
          + ssd               = false
        }

      + memory {
          + dedicated      = 4096
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + vga (known after apply)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ linux_vms      = {
      + vm3 = {
          + id   = (known after apply)
          + ip   = (known after apply)
          + name = "testvm3"
        }
      + vm4 = {
          + id   = (known after apply)
          + ip   = (known after apply)
          + name = "testvm4"
        }
        # (2 unchanged attributes hidden)
    }

```